tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ruiokazaki/gpt-naming"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
brew "act"
brew "node"
brew "corepack"
brew "curl"
brew "sqlite"
brew "python@3.11"
brew "firebase-cli"
brew "flyctl"
brew "git"
brew "git-delta"
brew "gitmoji"
brew "go"
brew "hub"
brew "jenv"
brew "lua-language-server"
brew "luv"
brew "meilisearch"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "nodebrew"
brew "openjdk"
brew "openjdk@17"
brew "pnpm", link: false
brew "tcl-tk"
brew "python@3.8"
brew "rbenv"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "terraform"
brew "tmux"
brew "yarn", link: false
brew "zoxide"
brew "fsouza/prettierd/prettierd"
brew "ruiokazaki/gpt-naming/gpt-naming"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "android-sdk"
cask "android-studio"
cask "arc"
cask "asana"
cask "authy"
cask "brave-browser"
cask "centered"
cask "cron"
cask "deepl"
cask "deltachat"
cask "discord"
cask "fig"
cask "figma"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "ipfs"
cask "iterm2"
cask "miro"
cask "notion"
cask "postman"
cask "pritunl"
cask "raindropio"
cask "rancher"
cask "raycast"
cask "sketch"
cask "spectacle"
cask "stoplight-studio"
cask "tableplus"
cask "ticktick"
cask "visual-studio-code"
cask "wezterm"
cask "wrike"
cask "zed"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "lokalise.i18n-ally"
vscode "miguelsolorio.fluent-icons"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "Prisma.prisma"
vscode "ritwickdey.LiveServer"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "steoates.autoimport"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "teabyii.ayu"
vscode "toba.vsfire"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "yamatsum.vscode-nonicons"
