tap "aws/tap"
tap "dart-lang/dart"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "leoafarias/fvm"
tap "qovery/qovery-cli"
tap "ruiokazaki/gpt-naming"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
# Run your GitHub Actions locally
brew "act"
# Build full-stack web and mobile apps in hours. Easy to start, easy to scale
brew "aws-amplify"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Generate compilation database for clang tooling
brew "bear"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Package acting as bridge between Node projects and their package managers
brew "corepack", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Text processing system for reStructuredText
brew "docutils"
# AST-based pattern checker for JavaScript
brew "eslint"
# Firebase command-line tools
brew "firebase-cli"
# Command-line tools for fly.io services
brew "flyctl"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Add GitHub support to git on the command-line
brew "hub"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Libraries for security-enabled client and server applications
brew "nss"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Quick and easy command-line file transfer utility from any computer to another
brew "portal"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# CLI tool that randomly returns words that can be used for code review approve
brew "rando_lgtm"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Command-line interface for Vercel
brew "vercel-cli"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Refactoring tool for Erlang with emacs and Eclipse integration
brew "wrangler"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Deploy modern application in seconds
brew "qovery/qovery-cli/qovery-cli"
# Tools for the Android SDK
cask "android-sdk"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open-source keystroke visualiser
cask "keycastr"
# Online collaborative whiteboard platform
cask "miro"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# OpenVPN client
cask "pritunl"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Native GUI tool for relational databases
cask "tableplus"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Project management app
cask "wrike"
# View output from scripts in the menu bar
cask "xbar"
# Desktop client for the Zulip team chat platform
cask "zulip"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "lokalise.i18n-ally"
vscode "miguelsolorio.fluent-icons"
vscode "moonbit.moonbit-lang"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "steoates.autoimport"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "taichi.vscode-textlint"
vscode "teabyii.ayu"
vscode "toba.vsfire"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yamatsum.vscode-nonicons"
