tap "aws/tap"
tap "dart-lang/dart"
tap "fastly/tap"
tap "fsouza/prettierd"
tap "grishka/grishka"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "leoafarias/fvm"
tap "oven-sh/bun"
tap "qovery/qovery-cli"
tap "ruiokazaki/gpt-naming"
tap "supabase/tap"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
# Run your GitHub Actions locally
brew "act"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Build full-stack web and mobile apps in hours. Easy to start, easy to scale
brew "aws-amplify"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Next generation open source RPC library and framework
brew "grpc"
# Generate compilation database for clang tooling
brew "bear"
# Object-file caching compiler wrapper
brew "ccache"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# AST-based pattern checker for JavaScript
brew "eslint"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Firebase command-line tools
brew "firebase-cli"
# Command-line tools for fly.io services
brew "flyctl"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Libraries for security-enabled client and server applications
brew "nss"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Quick and easy command-line file transfer utility from any computer to another
brew "portal"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Command-line interface for Vercel
brew "vercel-cli"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Refactoring tool for Erlang with emacs and Eclipse integration
brew "wrangler"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A CLI for interacting with the Fastly platform
brew "fastly/tap/fastly"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Deploy modern application in seconds
brew "qovery/qovery-cli/qovery-cli"
# Supabase CLI
brew "supabase/tap/supabase"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Tools for building Android applications
cask "android-studio"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Matrix collaboration client
cask "element"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Open-source keystroke visualiser
cask "keycastr"
# Agent-centric IDE with spec-driven development
cask "kiro"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Unofficial Google Nearby Share app
cask "neardrop"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# OpenVPN client
cask "pritunl"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Digital design and prototyping platform
cask "sketch"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Native GUI tool for relational databases
cask "tableplus"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Project management app
cask "wrike"
# View output from scripts in the menu bar
cask "xbar"
# Multiplayer code editor
cask "zed"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "Bear", id: 1091189122
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "asvetliakov.vscode-neovim"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lokalise.i18n-ally"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "npclaudiu.vscode-gn"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "twxs.cmake"
vscode "v8-torque.vscode-torque"
vscode "vadimcn.vscode-lldb"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
